import { Container, makeStyles } from '@material-ui/core';
import React from 'react';

const useStyles = makeStyles(() => ({
  root: {
    position: "relative",
    backgroundColor:"white",
    marginTop:30
  }
}));

const AboutPage: React.FC = () => {
    const classes = useStyles();
    return (
      <Container className={classes.root}>
        <div>
          <br/>
          <h3>КРЕДИТ-ИНФО е вашиот личен финансиски советник!</h3>
          <br/>&emsp;За само неколку секунди на КРЕДИТИНФО.МК ќе го пронајдете кредитот што најмногу одоговара на вашите потреби. КРЕДИТ-ИНФО ги споредува сите кредити достапни во Македонија и ви ги презентира резултатите подредени од најдобар до најлош според
          вкупните трошоци и камати. <br/><br/>
          <h3>Како да направите пресметка?</h3>
          <ol>
              <li>Одберете тип на кредит (Потрошувачки,Станбен,Хипотекарен...)</li>
              <li>Одберете валута на кредит (EUR- Евра или MKD – Денари)</li>
              <li>Внесете потребен износ на кредит( Во валута што сте ја одбрале)</li>
              <li>Внесете потребен рок на кредит во години.</li>
              <li>Притиснете на копчето «Пресметај»</li>
          </ol>
          <br/>&emsp;За неколку секунди ќе се прикажат сите кредити што одговараат на вашите потреби подредени од «Супер Зделка» до «Арач лут без жал».<br/><br/>&emsp;Откако ќе се прикажат резултатите едноставно притиснете на копчето «Побарај Понуда» и во рок 2 работни
          дена ќе бидете телефонски исконтактирани од соодветната Банка за ви ги презентираат деталите за кредитот и уловите за одобрување. Клиентот после ова нема никакви обврски кон Банката.<br/><br/>&emsp;Ако сакате да видите повеќе детали за кредитот притиснете
          на «Види Повеќе» за детален преглед на трошоците што паѓаат на товар на клиентот, или «Аморт-План» за детален преглед на месечните рати со главница и камата.<br/><br/>
          <h3>Зошто да го користите КредитИнфо?</h3>
          <ul>
              <li>Лесно и брзо до информации</li>
              <li>Јасни и споредливи информации</li>
              <li>За секунди до најдобриот кредит според вашите желби и потреби</li>
              <li>Неограничен број на пресметки за најразлични износи,валути и типови кредити.</li>
              <li>Лесно и брзо до кредитна понуда од Банка</li>
              <li>Се ова со неколку клика од вашиот компјутер или смартфон</li>
              <li>Во секое време може да поставите прашање до КредитИнфо кое ќе ви биде одоговорено во најкраток рок</li>
          </ul>
          <br/>
        </div>
      </Container>
      
      )
}

export default AboutPage;